Crearé una funcion llamada PlayTime Genre(genero:str) que me devolverá año con más horas jugadas para dicho genero. Para lo cual empezaré importando la librería que necesito.

In [41]:
import pandas as pd

Crearé un dataset a partir del csv games_original.csv

In [42]:
df_games= pd.read_csv('../Data/games_original.csv')

C:\Users\MI PC\AppData\Local\Temp\ipykernel_10856\866917060.py:1: DtypeWarning: Columns (0,1,2,3,4,5,6,7,9,10,11,14,15,17) have mixed types. Specify dtype option on import or set low_memory=False.
  df_games= pd.read_csv('../Data/games_original.csv')

Del dataset anterior solo copiaré las columnas genres, realease_date y id porque las voy a necesitar para realizar la función

In [43]:
df_genero = df_games[['genres', 'id']].copy()

Voy a ver el dataset genero

In [44]:
df_genero

                                               genres        id
0                                                 NaN       NaN
1                                                 NaN       NaN
2                                                 NaN       NaN
3                                                 NaN       NaN
4                                                 NaN       NaN
...                                               ...       ...
120440  ['Casual', 'Indie', 'Simulation', 'Strategy']  773640.0
120441                ['Casual', 'Indie', 'Strategy']  733530.0
120442              ['Indie', 'Racing', 'Simulation']  610660.0
120443                            ['Casual', 'Indie']  658870.0
120444                                            NaN  681550.0

[120445 rows x 2 columns]

Eliminaré nulos

In [45]:
df_genero.dropna(inplace=True)

Cambio el nombre de la columna id por item_id porque luego voy a necesitar para poder unir los dataset

In [46]:
df_genero.rename (columns={'id':'item_id'}, inplace=True)

Creo un DataFrame a partir de los datos

In [47]:
df = pd.DataFrame(df_genero).reset_index(drop= True)

Voy a elimanar corchetes y comillas. Y utilizaré el metodo explode para desanidar la columna genres

In [48]:
df = df.assign(genres=df['genres'].str.strip('[]').str.replace("'", "").str.split(", ")).explode('genres')

Imprimo el dataset df

In [49]:
print(df)

           genres   item_id
0          Action  761140.0
0          Casual  761140.0
0           Indie  761140.0
0      Simulation  761140.0
0        Strategy  761140.0
...           ...       ...
28849       Indie  610660.0
28849      Racing  610660.0
28849  Simulation  610660.0
28850      Casual  658870.0
28850       Indie  658870.0

[71552 rows x 2 columns]

Crearé un dataset a partir del csv reviews.csv

In [11]:
df_games = pd.read_csv('../Data/games_original.csv')

C:\Users\MI PC\AppData\Local\Temp\ipykernel_10856\2852139781.py:1: DtypeWarning: Columns (0,1,2,3,4,5,6,7,9,10,11,14,15,17) have mixed types. Specify dtype option on import or set low_memory=False.
  df_games = pd.read_csv('../Data/games_original.csv')

Crearé otro dataset df_año para lo que copiaré las columnas release_date e item_i

In [12]:
df_año = df_games[['release_date', 'id']].copy()

In [13]:
df_año

       release_date        id
0               NaN       NaN
1               NaN       NaN
2               NaN       NaN
3               NaN       NaN
4               NaN       NaN
...             ...       ...
120440   2018-01-04  773640.0
120441   2018-01-04  733530.0
120442   2018-01-04  610660.0
120443   2017-09-02  658870.0
120444          NaN  681550.0

[120445 rows x 2 columns]

Extraigo el año de la columna release_date

In [14]:
df_año['año'] = df_año['release_date'].str[:4]

In [15]:
df_año

       release_date        id   año
0               NaN       NaN   NaN
1               NaN       NaN   NaN
2               NaN       NaN   NaN
3               NaN       NaN   NaN
4               NaN       NaN   NaN
...             ...       ...   ...
120440   2018-01-04  773640.0  2018
120441   2018-01-04  733530.0  2018
120442   2018-01-04  610660.0  2018
120443   2017-09-02  658870.0  2017
120444          NaN  681550.0   NaN

[120445 rows x 3 columns]

Elimino la columna release_date porque extraje el año que es lo que necesito para realizar la función

In [16]:
df_año= df_año.drop('release_date', axis=1)

Cambio el tipo de dato de la columna año de object a entero

In [17]:
df_año['año'] = pd.to_numeric(df_año['año'], errors='coerce')
df_año['año'] = df_año['año'].fillna(0).astype(int)

Elimino la fila que tenga cero en la columna año

In [18]:
df_año = df_año[df_año['año'] != 0]

In [19]:
df_año = df_año.rename(columns={'id':'item_id'})

In [20]:
df_año.info()

<class 'pandas.core.frame.DataFrame'>
Index: 29832 entries, 88310 to 120443
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   item_id  29831 non-null  float64
 1   año      29832 non-null  int32
dtypes: float64(1), int32(1)
memory usage: 582.7 KB

In [21]:
df_año.to_csv('año.csv')

Crearé un dataset df_horas del csv llamado horas.csv. Este dataset tiene dos columnas item_id y playtime_forever en las que puedo ver las horas jugadas por item_id es decir por cada videojuego

In [22]:
df_horas = pd.read_csv('../Data/horas.csv')

In [23]:
df_horas

       item_id  playtime_forever
0           10        17386015.0
1          100          311999.0
2        10000           63046.0
3         1002             894.0
4        10040               0.0
...        ...               ...
10973    99890          128136.0
10974     9990            2110.0
10975    99900        17259605.0
10976    99910          426680.0
10977    99920            2344.0

[10978 rows x 2 columns]

Uniré los dataset df_año con el  dataset df_horas teniendo en cuenta la columna item_id

In [24]:
df_hora_año = pd.merge(df_año, df_horas, on='item_id')

In [25]:
df_hora_año

       item_id   año  playtime_forever
0     282010.0  1997            9319.0
1         70.0  1998         2682852.0
2       1640.0  2006           27397.0
3       1630.0  2006           21111.0
4       2400.0  2006         1048156.0
...        ...   ...               ...
8755  259340.0  2003             371.0
8756      30.0  2003          758991.0
8757  200980.0  2003            3393.0
8758   13230.0  2004          349119.0
8759      80.0  2004         2503938.0

[8760 rows x 3 columns]

Vamos a unir los dataset df_hora_año con df teniendo en cuenta item_id

In [26]:
play = pd.merge(df, df_hora_año, on='item_id')

Eliminaré la columna item_id

In [27]:
#Eliminaré columnas
play= play.drop('item_id', axis=1)

In [28]:
play

         genres   año  playtime_forever
0        Action  1997            9319.0
1         Indie  1997            9319.0
2        Racing  1997            9319.0
3        Action  1998         2682852.0
4      Strategy  2006           27397.0
...         ...   ...               ...
21469  Strategy  2003            3393.0
21470       RPG  2003            3393.0
21471     Indie  2003            3393.0
21472    Action  2004          349119.0
21473    Action  2004         2503938.0

[21474 rows x 3 columns]

Agrupo los datos por genero y año

In [29]:
playTimeGenre = play.groupby(['genres', 'año'])['playtime_forever'].sum().reset_index()

Imprimo el dataset

In [30]:
print(playTimeGenre)

             genres   año  playtime_forever
0            Action  1983            3582.0
1            Action  1984             384.0
2            Action  1988           16243.0
3            Action  1989             607.0
4            Action  1990           18787.0
..              ...   ...               ...
338  Web Publishing  2013          335849.0
339  Web Publishing  2014           33732.0
340  Web Publishing  2015          348861.0
341  Web Publishing  2016             136.0
342  Web Publishing  2017            9713.0

[343 rows x 3 columns]

Encuentro el año com más horas jugadas para cada genero

In [31]:
maxHours = playTimeGenre.loc[playTimeGenre.groupby('genres')['playtime_forever'].idxmax()]

Imprimo el resultado

In [32]:
print(maxHours)

                        genres   año  playtime_forever
26                      Action  2012      1.099063e+09
59                   Adventure  2011      2.243480e+08
71    Animation &amp; Modeling  2015      1.354685e+06
75            Audio Production  2014      4.662460e+05
104                     Casual  2015      8.251535e+07
109  Design &amp; Illustration  2012      1.947406e+06
116               Early Access  2013      1.203663e+08
124                  Education  2013      3.428040e+05
141               Free to Play  2013      1.477287e+08
158                      Indie  2006      4.526728e+08
178      Massively Multiplayer  2013      1.349481e+08
186              Photo Editing  2014      6.165900e+04
208                        RPG  2011      2.307794e+08
235                     Racing  2015      3.791091e+07
257                 Simulation  2006      4.511054e+08
273          Software Training  2014      4.233280e+05
288                     Sports  2015      4.179597e+07
314                   Strategy  2013      1.474435e+08
324                  Utilities  2014      2.725654e+06
333           Video Production  2015      1.671790e+06
337             Web Publishing  2012      1.947406e+06

Creo un DataFrame de maxHours

In [62]:
df = pd.DataFrame(data=maxHours)

Elimino la columna playtime_forever ya que no la necesito para el retorno de la función.

In [63]:
df = df.drop('playtime_forever', axis=1)

Imprimo el df

In [64]:
# Imprimir el resultado
print(df)

                        genres   año
26                      Action  2012
59                   Adventure  2011
71    Animation &amp; Modeling  2015
75            Audio Production  2014
104                     Casual  2015
109  Design &amp; Illustration  2012
116               Early Access  2013
124                  Education  2013
141               Free to Play  2013
158                      Indie  2006
178      Massively Multiplayer  2013
186              Photo Editing  2014
208                        RPG  2011
235                     Racing  2015
257                 Simulation  2006
273          Software Training  2014
288                     Sports  2015
314                   Strategy  2013
324                  Utilities  2014
333           Video Production  2015
337             Web Publishing  2012

In [75]:
df.astype({'genres':'string'}).dtypes

genres    string[python]
año                int32
dtype: object

Guardaré el DataFrame en un csv

In [76]:
df.to_csv('playTimeGenre.csv', index= False)

Crearé la función

In [38]:
def PlayTimeGenre(genres):
    genero = df[df['genres'] == genres]

    if len(genero) == 0:
        return 'El género no existe'

    año = genero['año'].tolist()[0]

    return {'Año de lanzamiento con más horas jugadas para género': genres, 'año': año}

Pruebo la función

In [39]:
print(PlayTimeGenre('Simulation'))

{'Año de lanzamiento con más horas jugadas para género': 'Simulation', 'año': 2006}